aquarium_tycoon/app/controllers/animals_controller.rb

  def index
    @animals = Animal.all
---
SELECT `animals`.* FROM `animals`

  def create
    @animal = Animal.new(animal_params)

    respond_to do |format|
      begin
	if @animal.save
---
INSERT INTO `animals` (`animal_id`, `name`, `species`, `tank`, `birth_date`) VALUES (200, 'Bruce', 'Great White Shark', 1, '2017-11-23 22:21:00')

  def update
    respond_to do |format|
      begin
	if @animal.update(animal_params)
---
UPDATE `animals` SET `name` = '', `species` = 'Piranh', `birth_date` = '2012-01-18 00:00:00' WHERE `animals`.`animal_id` = 1

  def destroy
    @animal.destroy
---
DELETE FROM `animals` WHERE `animals`.`animal_id` = 200

    def set_animal
      @animal = Animal.find(params[:id])
---
SELECT  `animals`.* FROM `animals` WHERE `animals`.`animal_id` = 200 LIMIT 1