aquarium_tycoon/app/controllers/employees_controller.rb

  def index
    @employees = Employee.all
---
SELECT `employees`.* FROM `employees`

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      begin
	if @employee.save
---
INSERT INTO `employees` (`employee_id`, `first_name`, `last_name`, `hired_date`) VALUES (1, '', '', '{1=>2017, 2=>12, 3=>3}')

  def destroy
	respond_to do |format|
   begin
	   if @employee.update(fired_date: Time.now.strftime("%Y-%m-%d"))
---
UPDATE `employees` SET `fired_date` = '2017-12-05' WHERE `employees`.`employee_id` = 2

    def set_employee
      @employee = Employee.find(params[:id])
---
SELECT  `employees`.* FROM `employees` WHERE `employees`.`employee_id` = 2 LIMIT 1