aquarium_tycoon/app/controllers/event_registrations_controller.rb

  def index
    @event_registrations = EventRegistration.all
---
SELECT `event_registrations`.* FROM `event_registrations`

  def create
    @event_registration = EventRegistration.new(event_registration_params)

    respond_to do |format|
       begin
  if @event_registration.save
---
INSERT INTO `event_registrations` (`time`, `member_id`, `event_id`, `guest_count`) VALUES ('2017-12-04 06:16:42', 27, 5, 1)

  def update
    respond_to do |format|
        begin
  if @event_registration.update(event_registration_params)
---
UPDATE `event_registrations` SET `time` = '2017-12-04 06:58:13', `member_id` = 9, `event_id` = 2 WHERE `event_registrations`.`registration_code` = 1