aquarium_tycoon/app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT  `events`.* FROM `events` WHERE `events`.`event_id` = 1 LIMIT 1

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      begin
	if @event.save
---
INSERT INTO `events` (`title`, `price`, `managing_employee`, `max_guests_per_person`, `max_attending`, `event_date`) VALUES ('Test', 2.0, 1, 1, 4, '2017-12-06 15:47:00')

  def update
    respond_to do |format|
      begin
	if @event.update(event_params)
---
UPDATE `events` SET `title` = 'Amazon River Lecture', `managing_employee` = 1, `max_guests_per_person` = NULL, `event_date` = '2018-01-01 19:00:00' WHERE `events`.`event_id` = 2

    def set_event
      @event = Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`event_id` = 1 LIMIT 1