aquarium_tycoon/app/controllers/feeding_logs_controller.rb

  def index
    @feeding_logs = FeedingLog.all
---
SELECT `feeding_logs`.* FROM `feeding_logs`

  def create
    @feeding_log = FeedingLog.new(feeding_log_params)

    respond_to do |format|
      begin
	if @feeding_log.save
---
INSERT INTO `feeding_logs` (`feeding_id`, `time`, `food`, `quantity`, `employee_id`, `tank_id`) VALUES (888, '2017-12-04 05:09:00', 'fish', 99.0, 4, 4)

    def set_feeding_log
      @feeding_log = FeedingLog.find(params[:id])
---
SELECT  `feeding_logs`.* FROM `feeding_logs` WHERE `feeding_logs`.`feeding_id` = 888 LIMIT 1