aquarium_tycoon/app/controllers/habitats_controller.rb

  def index
    @habitats = Habitat.all
---
SELECT `habitats`.* FROM `habitats`

  def create
    @habitat = Habitat.new(habitat_params)

    respond_to do |format|
      begin
	if @habitat.save
---
INSERT INTO `habitats` (`name`, `description`, `year_added`) VALUES ('Test', 'Test1', 2017)

  def update
    respond_to do |format|
      begin
	if @habitat.update(habitat_params)
---
UPDATE `habitats` SET `name` = 'a', `description` = '', `year_added` = 2017 WHERE `habitats`.`habitat_id` = 1

  def destroy
    @habitat.destroy
---
DELETE FROM `habitats` WHERE `habitats`.`habitat_id` = 1

    def set_habitat
      @habitat = Habitat.find(params[:id])
---
SELECT  `habitats`.* FROM `habitats` WHERE `habitats`.`habitat_id` = 5 LIMIT 1