aquarium_tycoon/app/controllers/members_controller.rb

SELECT `members`.* FROM `members`
---
  def index
    @members = Member.all

INSERT INTO `members` (`first_name`, `last_name`, `date_joined`, `expiration_date`, `fee`) VALUES ('', '', '2017-12-04', '2019-06-04', 100.0)
---
  def create
    @member = Member.new(member_params)

    respond_to do |format|
     begin
	if @member.save

UPDATE `members` SET `first_name` = '', `last_name` = '', `date_joined` = '2017-12-06', `expiration_date` = '2019-06-06', `fee` = 100.0 WHERE `members`.`member_id` = 2
---
  def update
    respond_to do |format|
     begin
	if @member.update(member_params)

DELETE FROM `members` WHERE `members`.`member_id` = 17
---
  def destroy
    @member.destroy

SELECT  `members`.* FROM `members` WHERE `members`.`member_id` = 17 LIMIT 1
---
    def set_member
      @member = Member.find(params[:id])