aquarium_tycoon/app/controllers/tanks_controller.rb

  def index
    @tanks = Tank.all
---
SELECT `tanks`.* FROM `tanks`

  def create
    @tank = Tank.new(tank_params)

    respond_to do |format|
      begin
	if @tank.save
---
INSERT INTO `tanks` (`tank_id`, `name`, `description`, `water_type`, `volume`, `temperature`, `year_built`, `habitat_id`) VALUES (1, 'test1', 'test', 'asdf', 2000.0, 40.0, 1999, 2)

  def update
    respond_to do |format|
       begin
	if @tank.update(tank_params)
---
UPDATE `tanks` SET `name` = 'a', `description` = 'b', `volume` = 500.0, `temperature` = -1.0, `year_built` = 2017 WHERE `tanks`.`tank_id` = 1

  def destroy
    @tank.destroy
---
DELETE FROM `tanks` WHERE `tanks`.`tank_id` = 18

    def set_tank
      @tank = Tank.find(params[:id])
---
SELECT  `tanks`.* FROM `tanks` WHERE `tanks`.`tank_id` = 18 LIMIT 1