aquarium_tycoon/app/controllers/treatment_logs_controller.rb

  def index
    @treatment_logs = TreatmentLog.all
---
SELECT `treatment_logs`.* FROM `treatment_logs`

  def create
    @treatment_log = TreatmentLog.new(treatment_log_params)

    respond_to do |format|
      begin
	if @treatment_log.save
---
INSERT INTO `treatment_logs` (`time`, `medicine`, `quantity`, `employee_id`, `animal_id`) VALUES ('2017-12-06 12:28:07', 'Test', 0.0, 2, 1)

    def set_treatment_log
      @treatment_log = TreatmentLog.find(params[:id])
---
SELECT  `treatment_logs`.* FROM `treatment_logs` WHERE `treatment_logs`.`treatment_id` = 53 LIMIT 1