aquarium_tycoon/app/views/treatment_logs/_form.html.erb

SELECT  `animals`.* FROM `animals` WHERE `animals`.`animal_id` = 1 LIMIT 1
---
    <%= form.label :animal_id %>
    <%= form.collection_select(:animal_id, Animal.all, :animal_id, :id_name) %>