aquarium_tycoon/app/views/animals/_form.html.erb

SELECT `tanks`.* FROM `tanks` ORDER BY name
---
    <%= form.label :tank_id %>
    <%= form.collection_select(:tank_id, Tank.order('name'), :tank_id, :name) %>