aquarium_tycoon/app/views/feeding_logs/_form.html.erb

    <%= form.label :tank_id %>
    <%= form.collection_select(:tank_id, Tank.order('name'), :tank_id, :name) %>
---
SELECT `tanks`.* FROM `tanks` ORDER BY name