aquarium_tycoon/app/views/tanks/_form.html.erb

    <%= form.label :habitat_id %>
    <%= form.collection_select(:habitat_id, Habitat.order('name'), :habitat_id, :name) %>
---
SELECT `habitats`.* FROM `habitats` ORDER BY name